Firma/nalog_encrypted_and_signed.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><ns2:getNalogZaPlacanjeRequest xmlns:ns2="http://nalogZaPlacanje.xml.com" xmlns:ns3="http://zahtevzadobijanjeizvoda.xml.com"><xenc:EncryptedData xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" Type="http://www.w3.org/2001/04/xmlenc#Content"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#tripledes-cbc"/><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:KeyName>Sifrovan tajni kljuc</ds:KeyName>
<xenc:EncryptedKey><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-1_5"/><xenc:CipherData><xenc:CipherValue>Q731BQBcUdxbHtL28HJpYLD8Gv6Oo7qCBW/dgtW9hHGNzi9eISsbNg6BFkhxHfB7b54Ba3hul4Yw&#13;
F9dkv9ylTRx4pw+45eIqzY3FY3UmsO+FRvX6db1NHOlfFh3SjkhZZICX9Ej4J34RZaMiCiS0u3dv&#13;
lI5BdMo+Hb2Wu6xTnHzyc8NEreRQLpKcJrbSt9jz36QVdT38SNPDKKNw2dHChn+C8ssmfdXv3cYE&#13;
VDRDFGAwwcSj6YQX0PL9n/9ygEbSM27zk1iqgON/2tFel4aNJVXd0c4wc7GbOVOC/hs3CTAu7Y/I&#13;
AFbyXOD5U2WV3hEjoCUVlKL275+HRYSPkMiEjQ==</xenc:CipherValue></xenc:CipherData></xenc:EncryptedKey></ds:KeyInfo><xenc:CipherData><xenc:CipherValue>Taf6GSarxzPkrpHp8Qepb8+UiFtOJnFKjpwGSxkW1BKNozX/jqywnc7ZoWKNAm/4DJUARO+V2Rhi&#13;
2WP4MsCNZ23hd/NhaAnPwHFaK9nzFsK3db+87WRR897G+COs1a4yyKU4dMzieHHWdby+P5WjutYW&#13;
45hbPaZG6RTv72v5ztl8v2Yuw8rJ7aTViDE1aZD2RFWgPA6DtTF4+RfK6vDTGXtThef9AXyy+ISh&#13;
Ra8A8wXTTWRHzeMBS0w1/x/rG1pXTBvig3cYsCByGA5dh8YVoVh7A5oHOfdi87sdppTkPhcceaZB&#13;
3GM2W7r/lByKkpU4V4uhHtKUPKIjm3HGAhmBqrI+nPaiKRsr4UynahKRq2mH88k0U6IJEPkNJIpI&#13;
Eg0A9TPvRx+eDQiA7EwkBJtTTUEO/iYiYJETn4A6bIZLdFkeYDQxPnhFWPVSAXPalPC2uFutlhEu&#13;
8t4yRoMbCDbN4g9HoQS4mCVWMzzOsteAexxhgOOUePllL/SclRNbrIo+2tzfvYWFauEqVijnjEwv&#13;
cdNNHN8uQBQwxJt4eiieO6UTGMHPqKpACGFRlyly+vJsV26qxr16TwDll+vhostDLakC2NGsFr26&#13;
aQ4ZGak0DbhbHkntF/rSfsOluSZcUvtf+4hzuqm9V++hU4SDM4e5XjS2+FeJPQC8tKNzBw3rXvhW&#13;
QoIhDI76BLVMjj1rfKkt4cmV9c/gGYCuZ55YOKP/KQEkThEHnyNGP8JwiJkPedNQx8UKwuY9XYY3&#13;
OWnIu6vhrp7MJCl4y/lsDHZzwXPmLWEvtceNaHf1sUEAY3bPXVRDO+IhH5Ut2tJD5RaVUdf/rKOK&#13;
Vxcrrj+EkovqtVpW5bNsKsd7qLUk3gt7PbG/HL+G1KlETrtBjcilQwCOg0QKKV6V+NnW3FOHHKuu&#13;
iiwi06mQfbW5LBhwh9y9S+QVypVDiF3vd7PVMkW91Hu0UQZi</xenc:CipherValue></xenc:CipherData></xenc:EncryptedData></ns2:getNalogZaPlacanjeRequest></SOAP-ENV:Body><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:SignedInfo>
<ds:CanonicalizationMethod Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315"/>
<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
<ds:Reference URI="">
<ds:Transforms>
<ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
<ds:Transform Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315#WithComments"/>
</ds:Transforms>
<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
<ds:DigestValue>5ftokInsGtS5E3Ys/x914MavkwQ=</ds:DigestValue>
</ds:Reference>
</ds:SignedInfo>
<ds:SignatureValue>
fdufso2zpp9SqpQInSUFvIM5ujFsWmE9WOuSYgVXVaIVQCMp5vQKr2BdM78WCKOIwNviw3W4oXDg&#13;
jrkefxAKoeGC0zlkhKfckjMKbxttrIv0cdEFUaSixBBD3M5OGbHxfawmBysLAx6D46MbTucVlc6m&#13;
OPVY3PSLF0r5hlf3F+9nRbJLWi1IfB+oFppaQKJiLMCfs8Kx+UOs1mN1CqK0c+G3uDqYiBf++xXe&#13;
kIzwyoDI+ER5WkEnjgcOk/h41H+dDmu79yr7gVRBBoU4ax3H6i8gDGac4rQ//skHN7EJVj6ffXb9&#13;
4q2U1p377GjuHHb6GThnPscBFmBek4Dtud/urg==
</ds:SignatureValue>
<ds:KeyInfo>
<ds:KeyValue>
<ds:RSAKeyValue>
<ds:Modulus>
qvq9L4TdlpRND/aAnYa969IckeVyjGtDV1DHs/GvtFYRHuW6giXxjm3SUtVtTQoRTIoqBSLfpMBe&#13;
JODaAh6rACQpAgWymU4pbRXz7UIPhhpkyNeEXwtl63ILNOtIj6bMGtKnj6cmMYzNvUoQBixbFTSg&#13;
ixi3O996Z/YvRQLgW1obxiooCBoZuFEnFlfcUzCtHE5XmvZUWs4EjNA/oj9H2rJ34SMBz89XNyTl&#13;
0TBQh4ZPYw0WxzDJAyrtAGLWaPq1vOyA8PnXX33kQHGB7ZJVTVDlsFoD3ftWYQ63/LPshqM3P8BE&#13;
/uav8luUhVcVRDCDfvvpvmmJSVi7fK0zY4QQ7Q==
</ds:Modulus>
<ds:Exponent>AQAB</ds:Exponent>
</ds:RSAKeyValue>
</ds:KeyValue>
<ds:X509Data>
<ds:X509Certificate>
MIIDgjCCAmqgAwIBAgIEWUhRPjANBgkqhkiG9w0BAQsFADB6MRAwDgYDVQQDDAdCYW5rYSBBMRAw&#13;
DgYDVQQKDAdCYW5rYSBBMQ4wDAYDVQQLDAVCYW5rYTEMMAoGA1UEBhMDc3JiMRowGAYJKoZIhvcN&#13;
AQkBFgtiYW5rYUBhLmNvbTEaMBgGCgmSJomT8ixkAQEMCjE0OTc5MTE0OTIwHhcNMTcwNjE5MDAw&#13;
MDAwWhcNMTgwNjE5MDAwMDAwWjB6MRAwDgYDVQQDDAdGaXJtYSBBMRAwDgYDVQQKDAdGaXJtYSBB&#13;
MQ4wDAYDVQQLDAVGaXJtYTEMMAoGA1UEBhMDc3JiMRowGAYJKoZIhvcNAQkBFgtmaXJtYUBhLmNv&#13;
bTEaMBgGCgmSJomT8ixkAQEMCjE0OTc5MTE2MTQwggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEK&#13;
AoIBAQCq+r0vhN2WlE0P9oCdhr3r0hyR5XKMa0NXUMez8a+0VhEe5bqCJfGObdJS1W1NChFMiioF&#13;
It+kwF4k4NoCHqsAJCkCBbKZTiltFfPtQg+GGmTI14RfC2Xrcgs060iPpswa0qePpyYxjM29ShAG&#13;
LFsVNKCLGLc733pn9i9FAuBbWhvGKigIGhm4UScWV9xTMK0cTlea9lRazgSM0D+iP0fasnfhIwHP&#13;
z1c3JOXRMFCHhk9jDRbHMMkDKu0AYtZo+rW87IDw+ddffeRAcYHtklVNUOWwWgPd+1ZhDrf8s+yG&#13;
ozc/wET+5q/yW5SFVxVEMIN+++m+aYlJWLt8rTNjhBDtAgMBAAGjEDAOMAwGA1UdEwEB/wQCMAAw&#13;
DQYJKoZIhvcNAQELBQADggEBABPql7l2SOkUU7ON9SEqNswIVn+RyAL+Y/9OBJ+0aU0lcvpgbFNZ&#13;
5GsCMufSLRK0z1HU2rKW969FAnxAbfvMAvTh8a1VKuSF1P259bjFSoCekPfDW8irKtdBwlXUQtfn&#13;
Av2mVWLhk9XhBQtN78BktFLuXG7aRfbgb6L/e9M6Z1XFM8QK5WzBo1Y/7C7js7R0thIX9OsBs0gD&#13;
yoK644NxtAH2JljgqREpcjKZwNhfXZ++SIK8O5zUM7hlo1C7N1XqkURhc7J5ADRIHf5cOJCqiE6d&#13;
Q2WnEbguq2W6D5tTN/qjfkOtu1AWa29vz3O2piue9WkfIqxC84/llz20jrIWfow=
</ds:X509Certificate>
</ds:X509Data>
</ds:KeyInfo>
</ds:Signature></SOAP-ENV:Envelope>